# SaveAsOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SaveAsOptions Properties
SaveAsOptions Class See Also
---
The SaveAsOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Compact | Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MaximumBackups | The maximum number of backups to keep on disk. |
| OverwriteExistingFile | Identifies if the operation should be able to overwrite an existing file. |
| PreviewViewId | The view id that will be used to generate the preview; this id is not saved to the document's permanent settings. |

# See Also
SaveAsOptions Class
Autodesk.Revit.DB Namespace